src/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиБлюд</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПродуктов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товары</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиБлюд</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ОстаткиПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПродуктов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/РасходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ТоварыЕдиницыИзмеренияПриИзмененииНаСервере(ТоварДляПродажи,ВидЗапроса)
	Запрос = Новый Запрос;
	ЗапросНаОстатокБлюд = 
	"ВЫБРАТЬ
	|	ОстаткиБлюдОстатки.Блюдо КАК Блюдо,
	|	ОстаткиБлюдОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиБлюд.Остатки КАК ОстаткиБлюдОстатки
	|ГДЕ
	|	ОстаткиБлюдОстатки.Блюдо = &Блюдо
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиБлюдОстатки.КоличествоОстаток,
	|	ОстаткиБлюдОстатки.Блюдо";
	
	ЗапросНаОстатокПродуктов = 
	"ВЫБРАТЬ
	|	ОстаткиПродуктовОстатки.Продукт КАК Продукт,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиПродуктов.Остатки КАК ОстаткиПродуктовОстатки
	|ГДЕ
	|	ОстаткиПродуктовОстатки.Продукт = &Продукт
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПродуктовОстатки.Продукт,
	|	ОстаткиПродуктовОстатки.КоличествоОстаток";
	
	Если ВидЗапроса = "ОстатокПродуктов" Тогда
		Запрос.Текст = ЗапросНаОстатокПродуктов;
		Запрос.УстановитьПараметр("Продукт",ТоварДляПродажи);
	Иначе
		Запрос.Текст = ЗапросНаОстатокБлюд;
		Запрос.УстановитьПараметр("Блюдо",ТоварДляПродажи);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаИзЗапроса = РезультатЗапроса.Выгрузить();
	КоличествоПродуктаНаСкладе = ТаблицаИзЗапроса.Итог("КоличествоОстаток");
	Возврат КоличествоПродуктаНаСкладе;
КонецФункции

&НаКлиенте
Процедура ТоварыЕдиницыИзмеренияПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ТоварДляПродажи = СтрокаТабличнойЧасти.Товары;
	КоличествоТовараДляПродажи = СтрокаТабличнойЧасти.Количество;
	ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницыИзмерения;
	ВидЗапроса = "ОстатокПродуктов";
	Если Строка(ЕдиницаИзмерения) = "Порц." Тогда
		ВидЗапроса = "ОстатокБлюд";
	КонецЕсли;
	КоличествоТовараНаСкладе = ТоварыЕдиницыИзмеренияПриИзмененииНаСервере(ТоварДляПродажи,ВидЗапроса);
	Если Строка(ЕдиницаИзмерения) = "Бут." Тогда
		КоличествоТовараНаСкладе = Цел(КоличествоТовараНаСкладе/0.930);//как достучаться отсюда до констант и перечислений не понял, по этому захардкодил
		ЕдиницаИзмерения = "Бут.";
	КонецЕсли;
	
	Если КоличествоТовараНаСкладе< КоличествоТовараДляПродажи Тогда
		Сообщить("Товара ("+ТоварДляПродажи+") не достаточно. На складе осталось "+КоличествоТовараНаСкладе+" "+ЕдиницаИзмерения);
		СтрокаТабличнойЧасти.Количество = 0;
	КонецЕсли;
КонецПроцедуры
